/*

	ax_memory - public domain
	Last update: 2015-10-10 Aaron Miller


	This library provides memory management utilities and allocators for various
	purposes. For instance, an implementation of Naughty Dog's Tagged Heaps is
	provided.

	
	USAGE
	=====

	Define AXMM_IMPLEMENTATION in exactly one source file that includes this
	header, before including it.

	The following don't need to be defined, as default definitions will be
	provided, but can be defined if you want to alter default functionality
	without modifying this file.

	AXMM_FUNC and AXMM_CALL control the function declaration and calling
	conventions. Ensure that all source files including this use the same
	definitions for these. (That can be done in your Makefile or project
	settings.)


	CONFIGURATION MACROS
	====================

	Define any of these to either 1 or 0 prior to including this header, if you
	want to alter the default functionality.

		AXMM_CXX_ENABLED
		----------------
		Enables the C++ parts of this. All C++ code is in the `ax` namespace.


	REPLACE HEAP ALLOCATORS
	========================

	You can specify your own allocator to use with this library by defining the
	axmm_def_alloc and axmm_def_free macros. By default they are defined to the
	standard C library's `malloc()` and `free()`.


	INTERACTIONS
	============

	ax_platform will be used if it's available, or has been included prior to
	this header.


# undef AXMM_CXX_ENABLED
# define AXMM_CXX_ENABLED           0
#endif

#ifndef AXMM__ENTER_C
# ifdef __cplusplus
#  define AXMM__ENTER_C             extern "C" {
# else
#  define AXMM__ENTER_C
# endif
#endif
#ifndef AXMM__LEAVE_C
# ifdef __cplusplus
#  define AXMM__LEAVE_C             }
# else
#  define AXMM__LEAVE_C
# endif
#endif

#ifndef AXMM_DEFPARM
# ifdef __cplusplus
#  define AXMM_DEFPARM(X_)          = (X_)
# else
#  define AXMM_DEFPARM(X_)
# endif
#endif

#ifndef AXMM_FUNC
# ifdef AX_FUNC
#  define AXMM_FUNC                 AX_FUNC
# else
#  define AXMM_FUNC                 extern
# endif
#endif
#ifndef AXMM_CALL
# ifdef AX_CALL
#  define AXMM_CALL                 AX_CALL
# else
#  define AXMM_CALL
# endif
#endif

#ifndef AXMM_THREADLOCAL
# if !defined( _MSC_VER ) /*|| _MSC_VER >= someversion*/
#  define AXMM_THREADLOCAL          __thread
# else
#  define AXMM_THREADLOCAL          __declspec(thread)
# endif
#endif

#ifndef AXMM_THREADSAFE
# define AXMM_THREADSAFE            1
#endif
#ifndef AXMM_THREADSAFE_LISTENERS
# define AXMM_THREADSAFE_LISTENERS  AXMM_THREADSAFE
#endif
#ifndef AXMM_THREADSAFE_ALLOCS
# define AXMM_THREADSAFE_ALLOCS     AXMM_THREADSAFE
#endif

#ifndef AXMM_LISTENERS_ENABLED
# define AXMM_LISTENERS_ENABLED     1
#endif

#ifndef AXMM_FORCEINLINE
# ifdef AX_FORCEINLINE
#  define AXMM_FORCEINLINE          AX_FORCEINLINE
# elif defined( _MSC_VER )
#  define AXMM_FORCEINLINE          __forceinline
# else
#  define AXMM_FORCEINLINE          inline
# endif
#endif

#ifndef AXMM_TYPES_DEFINED
# define AXMM_TYPES_DEFINED         1
# if AX_TYPES_DEFINED
typedef ax_u64_t                    axmm_u64_t;
typedef ax_s64_t                    axmm_s64_t;
typedef ax_u32_t                    axmm_u32_t;
typedef ax_s32_t                    axmm_s32_t;
typedef ax_u16_t                    axmm_u16_t;
typedef ax_s16_t                    axmm_s16_t;
typedef ax_sptr_t                   axmm_ptrdiff_t;
typedef ax_uptr_t                   axmm_size_t;
# elif defined( _MSC_VER )
#  include <stddef.h>
typedef unsigned __int64            axmm_u64_t;
typedef   signed __int64            axmm_s64_t;
typedef unsigned __int32            axmm_u32_t;
typedef   signed __int32            axmm_s32_t;
typedef unsigned __int16            axmm_u16_t;
typedef   signed __int16            axmm_s16_t;
typedef ptrdiff_t                   axmm_ptrdiff_t;
typedef size_t                      axmm_size_t;
# else
#  include <stdint.h>
#  include <stddef.h>
typedef uint64_t                    axmm_u64_t;
typedef  int64_t                    axmm_s64_t;
typedef uint32_t                    axmm_u32_t;
typedef  int32_t                    axmm_s32_t;
typedef uint16_t                    axmm_u16_t;
typedef  int16_t                    axmm_s16_t;
typedef ptrdiff_t                   axmm_ptrdiff_t;
typedef size_t                      axmm_size_t;
# endif
#endif
#ifdef ax_static_assert
ax_static_assert( sizeof( axmm_s64_t ) == 8, "ax_memory: size mismatch" );
ax_static_assert( sizeof( axmm_u64_t ) == 8, "ax_memory: size mismatch" );
ax_static_assert( sizeof( axmm_s32_t ) == 4, "ax_memory: size mismatch" );
ax_static_assert( sizeof( axmm_u32_t ) == 4, "ax_memory: size mismatch" );
ax_static_assert( sizeof( axmm_s16_t ) == 2, "ax_memory: size mismatch" );
ax_static_assert( sizeof( axmm_u16_t ) == 2, "ax_memory: size mismatch" );
ax_static_assert( sizeof( axmm_ptrdiff_t ) == sizeof( void * ), "ax_memory: size mismatch" );
ax_static_assert( sizeof( axmm_size_t ) == sizeof( void * ), "ax_memory: size mismatch" );
#endif

#ifndef axmm_def_alloc
# include <stdlib.h>
# define axmm_def_alloc(N_)         (malloc((N_)))
# define axmm_def_free(P_)          (free((P_)))
#endif

#ifndef axmm_assert
# ifdef AX_ASSERT
#  define axmm_assert               AX_ASSERT
# elif defined( DEBUG ) || defined( _DEBUG ) || defined( __DEBUG__ )
#  include <assert.h>
#  define axmm_assert               assert
# else
#  define axmm_assert(X_)           ((void)0)
# endif
#endif

#ifndef axmm_atomic_add32
# ifdef AX_ATOMIC_FETCH_ADD_FULL32
#  define axmm_atomic_add32         AX_ATOMIC_FETCH_ADD_FULL32
#  define axmm_atomic_sub32         AX_ATOMIC_FETCH_SUB_FULL32
#  define axmm_atomic_cmpxchg32     AX_ATOMIC_COMPARE_EXCHANGE_FULL32
